Revit 2027 API
MechanicalSystem.IsWellConnected Property
 Indicates if the system is well connected or not.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsWellConnected { get; }
Public ReadOnly Property IsWellConnected As Boolean
	Get
public:
property bool IsWellConnected {
	bool get ();
}
member IsWellConnected : bool with get
Property Value
Boolean
Remarks
 If the system is not well connected, parameters which need to be calculated are invalid.
See Also
Reference
MechanicalSystem Class
Autodesk.Revit.DB.Mechanical Namespace